cases/bigleafFoam/cubeTree_2D/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../constant/flowProperties"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $TRef;

boundaryField
{
    inlet
    {
	    type            fixedValue;
        value           uniform $TRef;
    }

    outlet
    {
	    type            zeroGradient;
    }

    sky
    {
        type            fixedValue;
        value           uniform $TRef;
    }


    ground
    {
        type            fixedValue;
        value           uniform $TRef;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
