cases/bigleafFoam/cubeTree_2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel      Newtonian;

// Laminar viscosity of air
nu                  nu [ 0 2 -1 0 0 0 0 ] 1.46e-5;

// Thermal expansion coefficient
// beta                beta [0 0 0 -1 0 0 0] 3e-03;

// Reference temperature
TRef                TRef [0 0 0 1 0 0 0] 293.15;

// Laminar Prandtl number
Pr                  Pr [0 0 0 0 0 0 0] 0.9;

// Turbulent Prandtl number
Prt                 Prt [0 0 0 0 0 0 0] 0.7;

// Laminar Schmidt number
Sc                  Sc [0 0 0 0 0 0 0] 0.9;

// Turbulent Schmidt number
Sct                 Sct [0 0 0 0 0 0 0] 0.7;

// ************************************************************************* //
