cases/bigleafFoam/cubeTree_2D/constant/vegetationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// vegetationModel     BigLeaf;

cpa                 cpa     [0 2 -2 -1 0 0 0] 1003.5; // specific heat of air at constant pressure

C                   C       [ 0 -1 0.5 0 0 0 0 ] 200; // proportionality factor

Cdf 		        Cdf     [ 0 0 0 0 0 0 0 ] 0.275; // leaf drag coefficient

betaD               betaD   [ 0 0 0 0 0 0 0 ] 4; // turbulent destruction coeff

betaP               betaP   [ 0 0 0 0 0 0 0 ] 1; // turbulent production coeff

H                   H       [ 0 1 0 0 0 0 0 ] 10.0; // max height of vegetation

kc                  kc      [ 0 0 0 0 0 0 0 ] 0.75; // extinction coefficient of radiation

l                   l       [ 0 1 0 0 0 0 0 ] 0.1; // characteristic length of leaf

lambda              lambda  [ 0 2 -2 0 0 0 0 ] 2500000; // latent heat of vaporization of water J/Kg

Rg0                 Rg0     [1 0 -3 0 0 0 0] 100; // global radiation at top of canopy

rhoa                rhoa    [1 -3 0 0 0 0 0 ] 1.225; // density of air

rs                  rs      [ 0 -1 1 0 0 0 0 ] 150; // stomatal resistance


// ************************************************************************* //
