cases/bigleafFoam/cubeTree_2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // p
    // {
    //     solver          GAMG;
    //     tolerance       1e-10;
    //     relTol          0.1;
    //     smoother        GaussSeidel;
    //     nPreSweeps      0;
    //     nPostSweeps     2;
    //     cacheAgglomeration on;
    //     agglomerator    faceAreaPair;
    //     nCellsInCoarsestLevel 10;
    //     mergeLevels     1;
    // }

    // "(U|k|T|epsilon)"
    // {
    //     solver          smoothSolver;
    //     smoother        symGaussSeidel;
    //     tolerance       1e-10;
    //     relTol          0.1;
    //     nSweeps         1;
    // }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.01;
    }

    "(U|T|q|k|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    // residualControl
    // {
    //     p               1e-3;//1e-3;
    //     U               1e-4;//1e-4;
    //     T               1e-2;
    //     "(k|epsilon)"   1e-4;//1e-4;
    // }
    residualControl
    {
        p               1e-2;
        U               1e-4;
        T               1e-2;
        // possibly check turbulence fields
        "(k|epsilon)"   1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.7;// 0.3
    }
    equations
    {
        U               0.3; // 0.7
        T               0.5;//0.7
        q               0.5;//0.7
        k               0.7;
        epsilon         0.7;
    }
}

// EXTRA ADDED
cache
{
    grad(U);
}

// ************************************************************************* //
